LR11/app/controllers/palindrome_controller.rb

SELECT "palindrome_results".* FROM "palindrome_results" WHERE "palindrome_results"."num" = ? LIMIT ?  [["num", 8676], ["LIMIT", 1]]
---
  def view
    num = params[:num].to_i
    if res = PalindromeResult.find_by_num(num)