LR12/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["name", "aaaaa"], ["created_at", "2020-12-11 19:13:25.107504"], ["updated_at", "2020-12-11 19:13:25.107504"], ["password_digest", "$2a$12$UrXkZczaAHRB8q39b6X9NeNWtFEbYcRFB7Lj/NRum6j/L/NxJN8RC"]]